# json是一种文件类型
# 通常用于传递数据,是当下较为流行的数据的传递载体

# 特点
# 所有的数据都以键值对的形式存在 - py dict字典
# 所有的key都是字符串,value可以是任意类型(字符串 数值 对象{} 列表[] 布尔值True/False)
# 对象 {key:value,key:value,...}
# 列表 [element,e,e,e,e,e,e,e,...]
# 对象和列表之间可以互相嵌套

# 对象嵌套列表 -
# {
#   "name":"大黄",
#   "age":34,
#   "hobby":["游戏","摩托车","手串","抽烟"]
# }

# 对象嵌套对象 -
# {
#   "name":"大黄",
#   "age":34,
#   "info": {
#       "idcard":"123456789",
#       "phone":"133110897811635465454"
#   }
# }

# 列表中嵌套对象
# [
#     {
#         "name":"大黄1",
#         "age":341
#     },
#     {
#         "name":"大黄2",
#         "age":342
#     },
#     {
#         "name":"大黄3",
#         "age":343
#     },
# ]

# 列表嵌套列表
